INSERT INTO person (name, email, password)
VALUES ('Игорь Воробьев', 'admin@ya.ru', 'igor123'),         -- 100000
       ('Виктория Санникова', 'vika@google.com', 'vika123'), -- 100001
       ('Михаил Гусев', 'misha@yahoo.com', 'misha123'); -- 100002

INSERT INTO role (role_type)
VALUES ('ADMIN'), -- 100003
       ('REGULAR'); -- 100004

INSERT INTO person_role (person_id, role_id)
VALUES (100000, 100003),
       (100000, 100004),
       (100001, 100004);

INSERT INTO restaurant(name, address)
VALUES ('Хмельная миля', 'Северное ш., д.50'),                    -- 100005
       ('Дед Мазай и дичь на гриле', 'Ивана Сусанина ул., д.1А'), -- 100006
       ('Карнавал', 'Шумана ул., д.9'); -- 100007

INSERT INTO menu(rest_id, date)
VALUES (100005, '2023-08-01'), -- 100008
       (100005, '2023-08-02'), -- 100009
       (100006, '2023-08-01'), -- 100010
       (100007, now()); -- 100011

INSERT INTO dish(name)
VALUES ('Беллини'),                 -- 100012
       ('Ахи-поке'),                -- 100013
       ('Крудо'),                   -- 100014
       ('Окономияки'),              -- 100015
       ('Тальята'),                 -- 100016
       ('Средиземноморский сибас'), -- 100017
       ('Стейк из кенгуру'),        -- 100018
       ('Теплый салат «Бурре»'); -- 100019

INSERT INTO menu_item(menu_id, dish_id, price)
VALUES (100008, 100019, 230.50),
       (100008, 100018, 120.99),
       (100008, 100017, 404.04),
       (100009, 100012, 15.2),
       (100009, 100013, 147.74),
       (100010, 100012, 1850.01),
       (100010, 100015, 3.33),
       (100011, 100016, 99.55);

INSERT INTO vote(person_id, menu_id, vote_date)
VALUES (100000, 100008, '2023-08-01'),
       (100000, 100009, '2023-08-02'),
       (100001, 100010, '2023-08-01'),
       (100001, 100011, now());

